---
layout: base
---

<script type="text/javascript">
 lexemeSparql = `
# Data for a specific character
SELECT DISTINCT
  ?description
  (?valueLabel AS ?value_) ?value_Url
  ?source ?sourceUrl
WHERE {
  VALUES ?character { wd:${ q } }
  {
    BIND(1 AS ?order)
    BIND("Label" AS ?description)
    ?character rdfs:label ?value .
	FILTER (LANG(?value) = 'en')
    BIND(?value AS ?valueLabel)
  }
  UNION 
  {
    BIND(2 AS ?order)
    BIND("Script" AS ?description)
    ?character wdt:P282 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../script?q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel)) AS ?value_Url)
  }
  UNION 
  {
    BIND(4 AS ?order)
    BIND("Instance of" AS ?description)
    ?character p:P31 ?value_statement .
    ?value_statement ps:P31 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../property_value?p=P31&q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P248 ?source_ .
      ?source_ rdfs:label ?source .
      FILTER (LANG(?source) = 'en')
      BIND(CONCAT("../reference?q=", SUBSTR(STR(?source_), 32),"&qLabel=",STR(?source))  AS ?sourceUrl)
    }
  }
  UNION 
  {
    # Homographs
    BIND(16 AS ?order)
    BIND("Time Periods" AS ?description)
    ?character wdt:P2348 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../q?q=",SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
  }
  UNION 
  {
    BIND(18 AS ?order)
    BIND("Compound" AS ?description)
    ?character wdt:P527 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = "en")
    BIND(CONCAT("../c?q=",SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel))  AS ?value_Url)
	FILTER (?value != wd:${ q })
  }
  UNION 
  {
    BIND(19 AS ?order)    
	{SELECT ?description (GROUP_CONCAT(?valuelabel; separator=" // ") AS ?valueLabel) WHERE {     
	  BIND("Phonetic value" AS ?description)
	  wd:${ q } wdt:P12436 ?valuelabel .
    }GROUP BY ?description }
  }
  UNION 
  {
    BIND(20 AS ?order)
    BIND("Described in" AS ?description)
    ?character p:P1343 ?value_statement .
    ?value_statement ps:P1343 ?value .
    ?value rdfs:label ?valueLab .
	OPTIONAL{?value p:P724 ?inetarchive_stat . ?inetarchive_stat ps:P724 ?inetarchive . OPTIONAL{?inetarchive_stat pq:P8330 ?offset .}OPTIONAL{?inetarchive_stat pq:P478 ?inettvol . }}
	OPTIONAL{?value_statement pq:P1810 ?valuenum .}
	OPTIONAL{?value_statement pq:P7421 ?refline .}
	OPTIONAL{?value_statement pq:P304 ?refpage .}
	BIND(COALESCE(?inettvol, "") As ?inetvol)
	BIND(COALESCE(?refvol, "") As ?refvoll)
	BIND(COALESCE(CONCAT(?valuenum, " "), "") As ?thenum)
	BIND(COALESCE(CONCAT("p. ",?refpage, ""), "") As ?thepage)
	BIND(COALESCE(CONCAT("l. ",?refline, ""), "") As ?theline)
	BIND(CONCAT(?thenum,?thepage,?theline) AS ?refnumber)
	BIND(IF(bound(?offset), xsd:integer(?refpage)+xsd:integer(?offset), ?refpage) AS ?realpage)
	BIND(COALESCE(CONCAT("https://archive.org/details/",?inetarchive,COALESCE(CONCAT("/page/n",STR(?realpage),"/mode/1up?view=theater"),"")),"") AS ?sourceUrl)
    BIND(IF(bound(?inetarchive), "↗", "") AS ?source)
    FILTER (LANG(?valueLab) = 'en')
	FILTER(?inetvol=?refvoll)
    BIND(CONCAT(?valueLab," [",?refnumber,"]") AS ?valueLabel)
    BIND(CONCAT("../reflist?q=", SUBSTR(STR(?value), 32),"&qLabel=",STR(?valueLabel),"&highlight=",STR(?refnumber))  AS ?value_Url)
  }
}
ORDER BY ?order
`

idSparql= `
# List of ids for a specific character
SELECT DISTINCT
  ?idprop ?idpropLabel (CONCAT(?formaturl,?id) AS ?idUrl) ?id
WHERE {
  VALUES ?character { wd:${ q } }
  ?character ?idprop ?id .
  ?idpropp wikibase:directClaim ?idprop ; wikibase:propertyType wikibase:ExternalId .
  OPTIONAL {
    ?idpropp wdt:P1630 ?formatur .
    BIND(REPLACE(STR(?formatur), "\\\\$1", "", "i") AS ?formaturl)
  }
  ?idpropp rdfs:label ?idpropLabel .
  FILTER(lang(?idpropLabel)="en")
}
`

 formsSparql = `
 # List of variants for a specific character
 SELECT
   ?form (GROUP_CONCAT(?timeperiodLab; separator=" // ") AS ?timeperiod)
   ?formLabel ?gottstein_code ?image (GROUP_CONCAT(distinct ?form; separator=" ") AS ?image_link)
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   ?form wdt:P180 wd:${ q } .
   ?form wdt:P31 wd:Q118867680 .
   OPTIONAL {?form wdt:P18 ?image .}
   OPTIONAL {?form wdt:P2348 ?timeperiod . ?timeperiod rdfs:label ?timeperiodLab . FILTER (LANG(?timeperiodLab) = "en")}
   OPTIONAL {?form wdt:P11957 ?gottstein_code .}
   OPTIONAL {
     ?form rdfs:label ?formLabel .
     FILTER (LANG(?formLabel) = "en")
   }
 }
 GROUP BY ?form ?formLabel ?image ?gottstein_code
 ORDER BY (STR(?form))
 `

 sensesSparql = `
# List of senses for a specific lexeme
 SELECT
  ?sense ?senseLab
  (GROUP_CONCAT(?gloss; separator=" // ") AS ?senseLabel)
  (IRI(CONCAT("https://commons.wikimedia.org/w/index.php?title=Special:Redirect/file&width=200&wpvalue=", 
          SUBSTR(STR(SAMPLE(?images)), 52))) AS ?sense_image)
 WHERE {
   wd:${ q } wdt:P180 ?sense .
   BIND(SUBSTR(STR(?sense), 32) AS ?senseLab)
   ?sense rdfs:label ?gloss .
   FILTER(LANG(?gloss)="en")
 }
 GROUP BY ?sense ?senseLab
 ORDER BY (STR(?sense))
`


readingsSparql = `
SELECT ?lexeme ?lexemeLabel (GROUP_CONCAT(?rep; separator=" // ") AS ?reps) WHERE {		       
  wd:${ q } rdfs:label ?charlabel .
  ?lexeme rdf:type ontolex:LexicalEntry ;          
     dct:language wd:Q36790 ;		   
     wikibase:lemma ?lexemeLabel  .  
   OPTIONAL {?lexeme ontolex:lexicalForm ?lf . ?lf ontolex:representation ?rep .}           
   FILTER(lang(?charlabel)="en")
   FILTER(STR(?lexemeLabel)=STR(?charlabel))
}
GROUP BY ?lexeme ?lexemeLabel
ORDER BY ?lexeme
`

usedinLexemeSparql=`
SELECT ?lexeme (GROUP_CONCAT(?lexemeLab; separator=" // ") AS ?lexemeLabel) (GROUP_CONCAT(?sensee; separator=" // ") AS ?sense) (GROUP_CONCAT(?senselabel; separator=" // ") AS ?senseLabel) ?lang ?langLabel WHERE {		       
  {SELECT ?lexeme ?lang ?langLabel WHERE {
  wd:${ q } wdt:P282 ?script .
  ?lang wdt:P282 ?script .
  ?lexeme a ontolex:LexicalEntry ;          
     dct:language ?lang ;
     wikibase:lemma ?lexemelabel .
    FILTER(contains(STR(?lexemelabel),"${ qLabel }"))
    ?lang rdfs:label ?langLabel . FILTER(lang(?langLabel)="en") 
   }
   }  
   OPTIONAL {?lexeme ontolex:sense ?sensee . ?sensee wdt:P5137 ?senseval .?senseval rdfs:label ?senselabel . FILTER(LANG(?senselabel)= "en") }
   ?lexeme wikibase:lemma ?lexemeLab .
}
GROUP BY ?lexeme ?lang ?langLabel
ORDER BY ?lexemeLabel
`

etymologySparql=`
SELECT DISTINCT
   ?form (GROUP_CONCAT(?timeperiodLab; separator=" // ") AS ?timeperiod)
   ?formLabel ?gottstein_code ?image (GROUP_CONCAT(distinct ?form; separator=" ") AS ?image_link)
   ?so
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   wd:Q87554995 wdt:P282 ?script .
   ?script p:P2348 ?tp . 
   ?tp ps:P2348 ?timeperiodd . 
   ?tp pq:P1545 ?so .
   ?form wdt:P180 wd:Q87554995 .
   ?form wdt:P31 wd:Q118867680 .
   ?form rdfs:label ?formLabel .
   FILTER (LANG(?formLabel) = "en")
   ?form wdt:P2348 ?timeperiodd . ?timeperiodd rdfs:label ?timeperiodLab . FILTER (LANG(?timeperiodLab) = "en")
   OPTIONAL {?form wdt:P18 ?image .}
   OPTIONAL {?form wdt:P11957 ?gottstein_code .}
 }
 GROUP BY ?form ?formLabel ?image ?gottstein_code ?so
 ORDER BY xsd:integer(?so)
`


 $(document).ready(function() {
     sparqlToDataTable(lexemeSparql, "#lexeme",
		       options={
			   linkPrefixes: {
				   value_Url: '../'
			   },
			   iframelink: true,
			   paging: true,
			   sDom: 'rt',
			   desc:"Information about the character depicted from its Unicode codepoint"
		       });
     sparqlToDataTable(formsSparql, "#forms",
		       options={			   
			   linkPrefixes: {
			       form: '../cf'
			   },
			   linkParams: {
			       form: '&qb='+q
			   },
			   paging: false, sDom: 'rt',});
     sparqlToDataTable(idSparql, "#lexemeids",
		       options={paging: false, sDom: 'rt',desc:"Identifiers describing this character in other databases"});
     sparqlToDataTable(sensesSparql, "#senses",
		       options={paging: false, sDom: 'rt',desc:"Senses of this character which derived from its depiction"});
     //sparqlToDataTable(readingsSparql, "#readings",
	//	       options={paging: true, sDom: 'rt',});
     sparqlToDataTable(usedinLexemeSparql, "#usedlexemes",
		       options={paging: true, sDom: 'rt',desc:"Lexemes which use this character",linkPrefixes: {
			       lexeme: '../l',
			       sense: '../ls'
			   }});
 });

</script>

 <div class="l-entry">
<dialog id="iframedialog" style="width:80%;height:80%">
<a id="iframenewtab" href="" target="_blank"><button class="btn btn-outline-dark btn-sm">Open in new tab</button></a><button id="closebutton" class="btn btn-outline-dark btn-sm" onclick="document.getElementById('iframedialog').close()" style="float: right;">x</button>
<iframe id="theiframe" style="width:98%;height:98%"></iframe>
</dialog>
     <h1>Character: ${ qLabel } (${ q })</h1>
     
     <p>
         <a title="Back"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="../script?q=${ qb }">←</a>
	 <a title="View and edit lexeme in Wikidata"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="https://www.wikidata.org/wiki/${ q }">Wikidata ↗</a>
     </p>
     
     <table class="table table-hover" id="lexeme"></table>
  	 <h2>Identifier</h2>
	 <table class="table table-hover" id="lexemeids"></table>
  	<h2>Attested Senses</h2>
     <div class="container">	
	<div class="row">
	 	<div class="col-12 col-lg-12">
		  <table class="table table-hover" id="senses"></table>
	      </div>
	 </div>
	  <h2>Unicode Compound and derivation graph</h2>
		
		<button class="btn btn-outline-dark btn-sm glyphicon glyphicon-fullscreen" onclick="toggleFullScreen('compoundembed')">FullScreen</button>
		<div class="embed-responsive embed-responsive-4by3">
		
		<iframe id="compoundembed" allow="fullscreen" loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23%20Show%20compound%20hierarchy%0A%23defaultView%3AGraph%0ASELECT%20%3Flexeme%20%3FlexemeLabel%20%3Fcompound%20(GROUP_CONCAT(%3FcompoundLab%3B%20separator%3D%22%20%2F%2F%20%22)%20AS%20%3FcompoundLabel)%0A%20%20%20%20WHERE%20%7B%0A%09%20%20BIND(wd%3A${ q }%20AS%20%3Flexeme)%0A%20%20%20%20%20%20%3Flexeme%20rdfs%3Alabel%20%3FlexemeLabel%20.%0A%09%20%20%7B%0A%20%20%20%20%20%20%20%20%3Flexeme%20wdt%3AP527%20%3Fcompound.%0A%20%20%20%20%20%20%20%20OPTIONAL%20%7B%0A%20%20%20%20%20%20%20%20%20%20%3Fcompound%20rdfs%3Alabel%20%3FcompoundLab%20.%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(LANG(%3FcompoundLab)%20%3D%20%22en%22)%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(%3Fcompound%20!%3D%20wd%3A${ q })%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%7DUNION%20%7B%0A%20%20%20%20%20%20%20%20%3Fcompound%20wdt%3AP527%20%3Flexeme%20.%0A%20%20%20%20%20%20%20%20OPTIONAL%20%7B%0A%20%20%20%20%20%20%20%20%20%20%3Fcompound%20rdfs%3Alabel%20%3FcompoundLab%20.%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(LANG(%3FcompoundLab)%20%3D%20%22en%22)%0A%20%20%20%20%20%20%20%20%20%20FILTER%20(%3Fcompound%20!%3D%20wd%3A${ q })%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%7D%0A%20%20%20%20GROUP%20BY%20%3Flexeme%20%3Fcompound%20%3FlexemeLabel" referrerpolicy="origin" sandbox="allow-scripts allow-same-origin allow-popups" ></iframe>

	</div>
  

   <h2>Sign Variants</h2>
	 <div class="row">
	    <div class="col-12 col-lg-12">
		  <table class="table table-hover" id="forms"></table>
	    </div>

	 </div>

    
    <h2>Etymology</h2>

	<button class="btn btn-outline-dark btn-sm glyphicon glyphicon-fullscreen" onclick="toggleFullScreen('imageembed')">FullScreen</button>	
	<div class="embed-responsive embed-responsive-4by3">

    <iframe id="imageembed" allow="fullscreen" loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%0A%20%23%20List%20of%20variants%20for%20a%20specific%20character%0A%23defaultView%3AImageGrid%0A%20SELECT%20DISTINCT%0A%20%20%20%3Fform%20(GROUP_CONCAT(%3FtimeperiodLab%3B%20separator%3D%22%20%2F%2F%20%22)%20AS%20%3Ftimeperiod)%0A%20%20%20%3FformLabel%20%3Fgottstein_code%20%3Fimage%20(GROUP_CONCAT(distinct%20%3Fform%3B%20separator%3D%22%20%22)%20AS%20%3Fimage_link)%0A%20%20%20%3Fso%0A%20%20%20%23%20(GROUP_CONCAT(DISTINCT%20%3Fhyphenation%3B%20separator%3D%22%20%2F%2F%20%22)%20AS%20%3Fhyphenations)%0A%20WHERE%20%7B%0A%20%20%20wd%3A${ q }%20wdt%3AP282%20%3Fscript%20.%0A%20%20%20%3Fscript%20p%3AP2348%20%3Ftp%20.%20%0A%20%20%20%3Ftp%20ps%3AP2348%20%3Ftimeperiodd%20.%20%0A%20%20%20%3Ftp%20pq%3AP1545%20%3Fso%20.%0A%20%20%20%3Fform%20wdt%3AP180%20wd%3A${ q }%20.%0A%20%20%20%3Fform%20wdt%3AP31%20wd%3AQ118867680%20.%0A%20%20%20%3Fform%20rdfs%3Alabel%20%3FformLabel%20.%0A%20%20%20FILTER%20(LANG(%3FformLabel)%20%3D%20%22en%22)%0A%20%20%20%3Fform%20wdt%3AP2348%20%3Ftimeperiodd%20.%20%3Ftimeperiodd%20rdfs%3Alabel%20%3FtimeperiodLab%20.%20FILTER%20(LANG(%3FtimeperiodLab)%20%3D%20%22en%22)%0A%20%20%20OPTIONAL%20%7B%3Fform%20wdt%3AP18%20%3Fimage%20.%7D%0A%20%20%20OPTIONAL%20%7B%3Fform%20wdt%3AP11957%20%3Fgottstein_code%20.%7D%0A%20%7D%0A%20GROUP%20BY%20%3Fform%20%3FformLabel%20%3Fimage%20%3Fgottstein_code%20%3Fso%0A%20ORDER%20BY%20xsd%3Ainteger(%3Fso)%0A%20" referrerpolicy="origin" sandbox="allow-scripts allow-same-origin allow-popups" ></iframe>

    </div>
	

     </div>

    <hr/>

    <h2>Used in lexemes</h2>

    <table class="table table-hover" id="usedlexemes"></table>
    
</div>


