---
layout: base
---

<script type="text/javascript">
 lexemeSparql = `
# Data for a specific character
SELECT DISTINCT
  ?description
  (?valueLabel AS ?value_) ?value_Url
  ?source ?sourceUrl
WHERE {
  VALUES ?character { wd:${ q } }
  {
    BIND(1 AS ?order)
    BIND("Label" AS ?description)
    ?character rdfs:label ?value .
	FILTER (LANG(?value) = 'en')
    BIND(?value AS ?valueLabel)
  }
  UNION 
  {
    BIND(2 AS ?order)
    BIND("Script" AS ?description)
    ?character wdt:P282 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../script?q=", SUBSTR(STR(?value), 32)) AS ?value_Url)
  }
  UNION 
  {
    BIND(4 AS ?order)
    BIND("Instance of" AS ?description)
    ?character p:P31 ?value_statement .
    ?value_statement ps:P31 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../property_value?p=P31&q=", SUBSTR(STR(?value), 32))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P248 ?source_ .
      ?source_ rdfs:label ?source .
      FILTER (LANG(?source) = 'en')
      BIND(CONCAT("../reference?q=", SUBSTR(STR(?source_), 32))  AS ?sourceUrl)
    }
  }
  UNION 
  {
    # Homographs
    BIND(16 AS ?order)
    BIND("Time Periods" AS ?description)
    ?character wdt:P2348 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../q?q=",SUBSTR(STR(?value), 32))  AS ?value_Url)
  }
  UNION 
  {
    BIND(18 AS ?order)
    BIND("Compound" AS ?description)
    ?character wdt:P527 ?value .
    ?value rdfs:label ?valueLabel .
	FILTER (LANG(?valueLabel) = "en")
    BIND(CONCAT("../c?q=",SUBSTR(STR(?value), 32))  AS ?value_Url)
	FILTER (?value != wd:${ q })
  }
  UNION 
  {
    BIND(20 AS ?order)
    BIND("Described in" AS ?description)
    ?character ontolex:lexicalForm? / p:P1343 ?value_statement .
    ?value_statement ps:P1343 ?value .
    ?value rdfs:label ?valueLabel .
    FILTER (LANG(?valueLabel) = 'en')
    BIND(CONCAT("../reference?q=", SUBSTR(STR(?value), 32))  AS ?value_Url)
    OPTIONAL {
      ?value_statement prov:wasDerivedFrom / pr:P854 ?sourceUrl .
      BIND("↗" AS ?source)
    }
  }
}
ORDER BY ?order
`

 formsSparql = `
 # List of variants for a specific character
 SELECT
   ?form ?timeperiod ?timeperiodLabel
   ?formLabel ?image
   # (GROUP_CONCAT(DISTINCT ?hyphenation; separator=" // ") AS ?hyphenations)
 WHERE {
   ?form wdt:P180 wd:${ q } .
   ?form wdt:P31 wd:Q118867680 .
   OPTIONAL {?form wdt:P18 ?image .}
   OPTIONAL {?form wdt:P2348 ?timeperiod . ?timeperiod rdfs:label ?timeperiodLabel . FILTER (LANG(?timeperiodLabel) = "en")}
   OPTIONAL {
     ?form rdfs:label ?formLabel .
     FILTER (LANG(?formLabel) = "en")
   }
 }
 GROUP BY ?form ?formLabel ?timeperiod ?timeperiodLabel ?image
 ORDER BY (STR(?form))
 `

 sensesSparql = `
# List of senses for a specific lexeme
 SELECT
  ?sense ?senseLab
  (GROUP_CONCAT(?gloss; separator=" // ") AS ?senseLabel)
  (IRI(CONCAT("https://commons.wikimedia.org/w/index.php?title=Special:Redirect/file&width=200&wpvalue=", 
          SUBSTR(STR(SAMPLE(?images)), 52))) AS ?sense_image)
 WHERE {
   wd:${ q } wdt:P180 ?sense .
   BIND(SUBSTR(STR(?sense), 32) AS ?senseLab)
   ?sense rdfs:label ?gloss .
 }
 GROUP BY ?sense ?senseLabel
 ORDER BY (STR(?sense))
`


 compoundsSparql = `
SELECT ?lexeme ?compound (GROUP_CONCAT(?compoundLabel; separator=" // ") AS ?other_compounds)
    WHERE {
	  BIND(wd:${ q } AS ?lexeme)
      ?lexeme wdt:P527 ?compound.
      OPTIONAL {
        ?compound rdfs:label ?compoundLabel .
        FILTER (LANG(?compoundLabel) = "en")
        FILTER (?compound != ${ q })
      }
    }
    GROUP BY ?lexeme ?compound  
`

lexemeSparql=`
SELECT ?lexeme ?lexemeLabel ?sense (GROUP_CONCAT(?senselabel; separator=" // ") AS ?senseLabel) WHERE {		       
  wd:${ q } rdfs:label ?charlabel .
  ?lexeme rdf:type ontolex:LexicalEntry ;          
     dct:language ?lang ;		   
     wikibase:lemma ?lexemeLabel  .  
   OPTIONAL {?lexeme ontolex:sense ?sense . ?sense wdt:P5137 ?senseval . 
   OPTIONAL { ?senseval rdfs:label ?senselabel . FILTER(LANG(?senselabel)= "en") }}	 
   FILTER(lang(?charlabel)="en")
   FILTER(contains(?lexemeLabel,?charlabel))
   ORDER BY ?lexeme
}
`


 $(document).ready(function() {
     sparqlToDataTable(lexemeSparql, "#lexeme",
		       options={
			   linkPrefixes: {
			       source: '../reference',
				   value_Url: '../'
			   },
			   paging: false,
			   sDom: 'rt',
		       });
     sparqlToDataTable(formsSparql, "#forms",
		       options={			   
			   linkPrefixes: {
			       form: '../cf'
			   },
			   paging: false, sDom: 'rt',});
     sparqlToDataTable(sensesSparql, "#senses",
		       options={paging: false, sDom: 'rt',});
     sparqlToDataTable(compoundsSparql, "#compounds",
		       options={paging: false, sDom: 'rt',});
     sparqlToDataTable(lexemeSparql, "#usedlexemes",
		       options={paging: false, sDom: 'rt',});
 });

</script>

 <div class="l-entry">

     <h1>Character: ${ q }</h1>
     
     
     <p>
         <a title="Back"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="../script?q=${ qb }">←</a>
	 <a title="View and edit lexeme in Wikidata"
	    role="button"
	    class="btn btn-outline-dark btn-sm"
	    href="https://www.wikidata.org/wiki/${ q }">Wikidata ↗</a>
     </p>
     
     <table class="table table-hover" id="lexeme"></table>
     
     <div class="container">
	 <div class="row">
	    <div class="col-12 col-lg-12">
		  <table class="table table-hover" id="forms"></table>
	    </div>

	 </div>
	 <div class="row">
	 	<div class="col-12 col-lg-12">
		  <table class="table table-hover" id="senses"></table>
	      </div>
	 </div>
     </div>

    <hr/>

    <h2>Used in lexemes</h2>

    <table class="table table-hover" id="usedlexemes"></table>
    
    <h2>Compounds</h2>

    <table class="table table-hover" id="compounds"></table>

    <h2>Compound and derivation graph</h2>
    
    <div class="embed-responsive embed-responsive-4by3">
	
<iframe style="width: 80vw; height: 50vh; border: none;" src="https://query.wikidata.org/embed.html#%23%20Show%20compound%20hierarchy%0A%23defaultView%3AGraph%0ASELECT%20%3Flexeme%20%3FlexemeLabel%20%3Fcompound%20%3FcompoundLabel%0A%20%20%20%20WHERE%20%7B%0A%09%20%20BIND%28wd%3A${ q }%20AS%20%3Flexeme%29%0A%20%20%20%20%20%20%3Flexeme%20wdt%3AP527%20%3Fcompound%20.%0A%20%20%20%20%20%20%3Flexeme%20rdfs%3Alabel%20%3FlexemeLabel%20.%0A%20%20%20%20%20%20FILTER%20%28LANG%28%3FlexemeLabel%29%20%3D%20%22en%22%29%0A%20%20%20%20%20%20OPTIONAL%20%7B%0A%20%20%20%20%20%20%20%20%3Fcompound%20rdfs%3Alabel%20%3FcompoundLabel%20.%0A%20%20%20%20%20%20%20%20FILTER%20%28LANG%28%3FcompoundLabel%29%20%3D%20%22en%22%29%0A%20%20%20%20%20%20%20%20FILTER%20%28%3Fcompound%20%21%3D%20wd%3A${ q }%29%0A%20%20%20%20%20%20%7D%0A%20%20%20%20%7D%0A%20%20" referrerpolicy="origin" sandbox="allow-scripts allow-same-origin allow-popups" ></iframe>


    
</div>


