---
layout: base
---

<script type="text/javascript">
  dataSparql = `
# tool: ordia
SELECT ?description ?value ?valueUrl
WHERE {
  BIND(wd:${ q } AS ?language)
  {
    BIND(1 AS ?order)
    BIND("Language" AS ?description)
    ?language rdfs:label ?value_string .
    FILTER (LANG(?value_string) = 'en')
    BIND(COALESCE(?value_string, ?q) AS ?value)
  }
  UNION
  {
    SELECT
      (2 AS ?order)
      ("Number of lexemes" AS ?description)
      (COUNT(*) AS ?value)
    {
      [] dct:language wd:${ q } .
      BIND(1 AS ?dummy)
    }
    GROUP BY ?dummy
  }
  UNION
  {
    SELECT
      (3 AS ?order)
      ("Number of senses" AS ?description)
      (COUNT(*) AS ?value)
    {
      [] ^ontolex:sense / dct:language wd:${ q } .
      BIND(1 AS ?dummy)
    }
    GROUP BY ?dummy
  }
  UNION
  {
    SELECT
      (4 AS ?order)
      ("Number of forms" AS ?description)
      (COUNT(*) AS ?value)
    {
      [] ^ontolex:lexicalForm / dct:language wd:${ q } .
      BIND(1 AS ?dummy)
    }
    GROUP BY ?dummy
  }
  UNION
  {
    BIND(10 AS ?order)
    BIND("Number of speakers" AS ?description)
    ?language wdt:P1098 ?value .
  }
} 
ORDER BY ?order
`;
  
 lexemesSparql = `
SELECT ?lexeme (GROUP_CONCAT(DISTINCT ?lexemeLab; SEPARATOR = " // ") AS ?lexemeLabel) (GROUP_CONCAT(DISTINCT ?sensse; SEPARATOR = " // ") AS ?senses) (GROUP_CONCAT(DISTINCT ?senseLabell; SEPARATOR = " // ") AS ?sensesLabel) ?lexical_category ?lexical_categoryLabel WHERE {
  {
  SELECT ?lexeme ?lexemeLab ?lexical_category ?lexical_categoryLabel WHERE {
  ?lexeme rdf:type ontolex:LexicalEntry;
    dct:language wd:${ q };
    wikibase:lemma ?lexemeLab ;
	wikibase:lexicalCategory ?lexical_category.
  ?lexical_category rdfs:label ?lexical_categoryLabel.
  FILTER(LANG(?lexical_categoryLabel) = "en")
  }}
  OPTIONAL {
    ?lexeme ontolex:sense ?senseitem.   
    OPTIONAL {
      ?senseitem wdt:P5137|wdt:P9970 ?sensee.
      ?sensee rdfs:label ?senseLab.
      FILTER(LANG(?senseLab)="en")
	  BIND(COALESCE(REPLACE(STR(?sensee), "http://www.wikidata.org/entity/", ""), "") AS ?sensse)
    }
    OPTIONAL {
		FILTER("${ displaylang }"!="en")
		?senseitem skos:definition ?glosss.
		FILTER(LANG(?glosss)="${ displaylang }")
		BIND(CONCAT(?glosss,"@${ displaylang }") AS ?gloss)
    }
    OPTIONAL {
		?senseitem skos:definition ?gloss.
		FILTER(LANG(?gloss)="en")
    }
    BIND(CONCAT(?gloss, COALESCE(CONCAT(" [", ?senseLab, " (", ?sensse, ")", "]"),"")) AS ?senseLabell)
  }
}
GROUP BY ?lexeme ?lexical_category ?lexical_categoryLabel
LIMIT 15000
`
lexicalCategoriesSparql = `
# tool: ordia
# title: Statistics for word class for a specific language
  SELECT
    (COUNT(*) AS ?count)
    ?lexical_category
    ?lexical_categoryLabel
    ?zoom ?zoomUrl
    ?lexical_categoryDescription
  WHERE{
    ?lexeme a ontolex:LexicalEntry ;
       dct:language wd:${ q } ; 
       wikibase:lexicalCategory ?lexical_category .
    OPTIONAL {?lexeme wdt:P31 ?instanceof . ?instanceof rdfs:label ?instanceofLabel . FILTER(LANG(?instanceofLabel)="en")}
	BIND("${ q }" AS ?lang)
	BIND("${ qLabel }" AS ?langLabel)
    ?lexical_category rdfs:label ?lexical_categoryLabell .
    ?lexical_category schema:description ?lexical_categoryDescription .
    FILTER(LANG(?lexical_categoryLabell)="en")
    FILTER(LANG(?lexical_categoryDescription)="en")
    BIND(CONCAT(?lexical_categoryLabell,COALESCE(CONCAT(" [",?instanceofLabel,"]"),"")) AS ?lexical_categoryLabel)
    BIND("→" AS ?zoom)
    BIND(CONCAT("../lexical-category?q=", SUBSTR(STR(?lexical_category), 32) ,COALESCE(CONCAT("&q2=",SUBSTR(STR(?instanceof),32)),""),"&qLabel=",?lexical_categoryLabel,"&l=",?lang,"&lLabel=",?langLabel) AS ?zoomUrl)
  }
GROUP BY ?lexical_category ?lexical_categoryLabel ?instanceof ?zoom ?zoomUrl ?lexical_categoryDescription
ORDER BY DESC(?count)
`

lexemesdialectSparql=`
# tool: ordia
# title: Dialects per lexeme
  SELECT DISTINCT ?dialect (GROUP_CONCAT(DISTINCT ?dialectLab; separator=" // ") AS ?dialectLabel) (COUNT(?lexeme) as ?number_of_lexemes) WHERE {
	?lexeme a ontolex:LexicalEntry ;
		dct:language wd:${ q } .
	?lexeme wdt:P7481 ?dialect .
	?dialect rdfs:label ?dialectLab .
	FILTER (LANG(?dialectLab) = "en")
  }
  GROUP BY ?dialect
  ORDER BY DESC(?number_of_lexemes)
`

lexemestimeperiodsSparql=`
# tool: ordia
# title: Time periods per lexeme
  SELECT DISTINCT ?timeperiod (GROUP_CONCAT(DISTINCT ?timeperiodLab; separator=" // ") AS ?timeperiodLabel) (COUNT(?lexeme) as ?number_of_lexemes) WHERE {
	?lexeme a ontolex:LexicalEntry ;
		dct:language wd:${ q } .
	?lexeme wdt:P2348 ?timeperiod .
	?timeperiod rdfs:label ?timeperiodLab .
	FILTER (LANG(?timeperiodLab) = "en")
  }
  GROUP BY ?timeperiod
  ORDER BY DESC(?number_of_lexemes)
`

 longestWordsAndPhrasesSparql = `
# tool: ordia
# title: List of longest words for a language
# https://lists.wikimedia.org/pipermail/wikidata/2018-October/012545.html
SELECT DISTINCT ?length ?form ?formLabel ?lexeme  (GROUP_CONCAT(DISTINCT ?lexemeLabell; separator=" // ") AS ?lexemeLabel) WHERE {
  ?lexeme a ontolex:LexicalEntry ;
          dct:language wd:${ q } ;
          wikibase:lemma ?lexemeLabell .
  ?lexeme ontolex:lexicalForm ?form .
  ?form ontolex:representation ?formLabel
  BIND(STRLEN(?formLabel) AS ?length)  
} 
GROUP BY ?length ?form ?formLabel ?lexeme
ORDER BY DESC(?length) 
LIMIT 200
  `

refsSPARQL=`
SELECT DISTINCT ?reference ?referenceLabel (COUNT(?lexeme) AS ?number_of_lexemes) WHERE {
  ?lexeme rdf:type ontolex:LexicalEntry;
    dct:language wd:${ q } .
  {
	?lexeme wdt:P1343 ?reference .
	?reference rdfs:label ?referenceLabel .
  }UNION{
      ?lexeme ?reference ?id . 
      ?idpropp wikibase:directClaim ?reference ; wikibase:propertyType wikibase:ExternalId .
      ?idpropp rdfs:label ?referenceLabel
  }
  FILTER(lang(?referenceLabel)="en")
}
GROUP BY ?reference ?referenceLabel
ORDER BY DESC(?number_of_lexemes)
`

 $(document).ready(function() {
     sparqlToDataTable(dataSparql, "#data");
     sparqlToDataTable(lexemesSparql, "#lexemes", {
	 'pBar':"progressbar",
	 'pBarLabel':"progress-label",
	 'linkPrefixes': {
	     'lexeme': '../l',
	     'lexical_category': '../lexical_category'
	  },
	  'linkParams':{
		'lexeme': '&qb='+q+'&qbLabel='+qLabel+'&displaylang='+displaylang
	  }
	  });
     sparqlToDataTable(lexicalCategoriesSparql, "#lexical-categories", {
	 'linkPrefixes': {
	     'lexical_category': '../lexical-category',
	 }});
	sparqlToDataTable(lexemesdialectSparql, "#lexemesdialect", {
	 'linkPrefixes': {
	     'dialect': '../dialect',
	 },linkParams: {
		dialect: '&l='+q+'&lLabel='+qLabel+'&displaylang='+displaylang
	 }});
	sparqlToDataTable(lexemestimeperiodsSparql, "#lexemestimeperiods", {
	 'linkPrefixes': {
	     'timeperiod': '../timeperiod',
	 },linkParams: {
		timeperiod: '&l='+q+'&lLabel='+qLabel+'&displaylang='+displaylang
	 }});
	 sparqlToDataTable(refsSPARQL, "#lexemesreference", {
		'linkPrefixes': {
	     'reference': '../reflistlang',
	 },linkParams: {
		reference: '&l='+q+'&lLabel='+qLabel+'&displaylang='+displaylang
	 }});
     sparqlToDataTable(longestWordsAndPhrasesSparql,
		       "#longest-words-and-phrases", {
			   'linkPrefixes': {
			       'form': '../lf',
			       'lexeme': '../l'}});
 });

</script>

<div class="language-entries">
  
  <h1>${ qLabel } (${ q })</h1>

  <a title="Back"
     role="button"
     class="btn btn-outline-dark btn-sm"
     href="../language_index/index.html">←</a>
  <a title="View and edit item in Wikidata"
     role="button"
     class="btn btn-outline-dark btn-sm"
     href="https://www.wikidata.org/wiki/${ q }">Wikidata ↗</a>
  <a title="View item in Reasonator"
     role="button"
     class="btn btn-outline-dark btn-sm"
     href="https://reasonator.toolforge.org/?&q=${ q }">Reasonator ↗</a>
  <a title="View item as a Scholia topic"
     role="button"
     class="btn btn-outline-dark btn-sm"
     href="https://scholia.toolforge.org/topic/${ q }">Scholia ↗</a>

	<a role="button" class="btn btn-outline-dark btn-sm" href="../lcombs?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Combinations</a> 
	<a role="button" class="btn btn-outline-dark btn-sm" href="../lderivs?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Derivations</a> 
	<a role="button" class="btn btn-outline-dark btn-sm" href="../ldevs?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Deviations</a> 
	<a role="button" class="btn btn-outline-dark btn-sm" href="../lradicals?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Radicals</a> 
	<a role="button" class="btn btn-outline-dark btn-sm" href="../ltrans?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Translations</a> 
	<a role="button" class="btn btn-outline-dark btn-sm" href="../limggrid?q=${ q }&qLabel=${ qLabel }&qb=${ q }">Lexeme Image Grid</a>

  <h2>Data</h2>

  <table class="table table-hover" id="data"></table>

  <h2>Lexemes</h2>
  <div id="progressbar"><span class="progress-label" id="progress-label">Loading...</span></div>
  <table class="table table-hover" id="lexemes"></table>




</div>



<h2>Lexical categories</h2>

  <div class="embed-responsive embed-responsive-4by3">
    <iframe loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23defaultView%3ABubbleChart%0A%23%20Count%20of%20lexemes%20wrt.%20lexical%20category%20for%20a%20language%0ASELECT%20%3Fcount%20%3Flexical_category%20%3Flexical_categoryLabel%20WHERE%20%7B%0A%7B%20%20SELECT%0A%20%20%20%20(COUNT(%3Flexeme)%20AS%20%3Fcount)%0A%20%20%20%20%3Flexical_category%0A%20%20%20%20%3Flexical_categoryLabell%20%3FinstanceofLabel%0A%20%20WHERE%7B%0A%20%20%20%20%3Flexeme%20a%20ontolex%3ALexicalEntry%20%3B%0A%20%20%20%20%20%20%20dct%3Alanguage%20wd%3A${ q }%20%3B%20%0A%20%20%20%20%20%20%20wikibase%3AlexicalCategory%20%3Flexical_category%20.%0A%20%20%20%20OPTIONAL%20%7B%3Flexeme%20wdt%3AP31%20%3Finstanceof%20.%20%3Finstanceof%20rdfs%3Alabel%20%3FinstanceofLabel%20.%20FILTER(LANG(%3FinstanceofLabel)%3D%22en%22)%7D%0A%20%20%20%20%3Flexical_category%20rdfs%3Alabel%20%3Flexical_categoryLabell%20.%0A%20%20%20%20FILTER(LANG(%3Flexical_categoryLabell)%3D%22en%22)%0A%7D%0AGROUP%20BY%20%3Flexical_category%20%3Flexical_categoryLabell%20%3FinstanceofLabel%0A%7D%0ABIND(CONCAT(%3Flexical_categoryLabell%2CCOALESCE(CONCAT(%22%20%5B%22%2C%3FinstanceofLabel%2C%22%5D%22)%2C%22%22)%2C%22%20(%22%2CSTR(%3Fcount)%2C%22)%22)%20AS%20%3Flexical_categoryLabel)%0A%7D%0AORDER%20BY%20DESC(%3Fcount)" referrerpolicy="origin" sandbox="allow-scripts allow-same-origin allow-popups"></iframe>
  </div>

  <table class="table table-hover" id="lexical-categories"></table>

<h2>Lexemes by dialect</h2>

<table class="table table-hover" id="lexemesdialect"></table> 

<h2>Lexemes by time period</h2>

<table class="table table-hover" id="lexemestimeperiods"></table>  

<h2>Lexemes by reference <a title="Reference Index"
     role="button"
     class="btn btn-outline-dark btn-sm"
     href="../refindex/?l=${ q }&lLabel=${ qLabel }">Reference Index</a></h2>

<table class="table table-hover" id="lexemesreference"></table>  
  
<h2>Longest words and phrases</h2>

<table class="table table-hover" id="longest-words-and-phrases"></table>


<h2>Toponym map</h2>
 
  <div class="embed-responsive embed-responsive-4by3">
    <iframe loading="lazy" class="embed-responsive-item" src="https://query.wikidata.org/embed.html#%23defaultView%3AMap%0ASELECT%20%3Flexeme%20(GROUP_CONCAT(DISTINCT%20%3Flemmaa%3B%20separator%3D%22%20%2F%2F%20%22)%20AS%20%3Flemma)%20%3Flocation%20%3Fgeo%20%7B%0A%20%20%3Flexeme%20dct%3Alanguage%20wd%3A${ q }%20%3B%0A%20%20%20%20%20%20%20%20%20%20wikibase%3Alemma%20%3Flemmaa%20%3B%0A%20%20%20%20%20%20%20%20%20%20ontolex%3Asense%20%2F%20wdt%3AP5137%20%3Flocation%20.%0A%20%20%3Flocation%20wdt%3AP625%20%3Fgeo%20.%0A%7D%0AGROUP%20BY%20%3Flexeme%20%3Flocation%20%3Fgeo"></iframe></div>



